---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.MechanicalEquipmentSetType
source: html/d4746a51-5dca-7cb4-d19a-5e1184ee6f39.htm
---
# Autodesk.Revit.DB.Mechanical.MechanicalEquipmentSetType

Represents a type for a set of interrelated mechanical equipment in a MEP system that works together.

## Syntax (C#)
```csharp
public class MechanicalEquipmentSetType : ElementType
```